setwd("I:/Bstat/RR")
#Άσκηση 1
Dat<-read.table("Data.txt",header=T,dec=",") #έχοντας φτιάξει το αρχείο το διαβάζουμε με την εντολή αυτη
cell<-c(Dat) #και με την εντολή αυτή το κάνουμε διάνυσμα
cells <- c(7.3, 7.7, 8.2, 7.6, 7.9, 7.6, 7.2, 7.2, 7.9, 7, 6.9, 7.7) #(ειχα ενα θεμα όπου μου διάβαζε το Τ και δεν με αφηνε να βρω τα παρακατω με τη χρήση του Dat οποτε το έκανα manually με την επόμενη εντολή)
m<-mean(cells) #χρήση τύπου μέσης τιμής
var(cells) #χρήση τύπου διασποράς
s <- sd(cells) #Ονόμασα s για χρήση της τυπικής απόκλισης παρακάτω. Εδω κάνουμε χρήση του τύπου της τυπικής απόκλισης
s
100*s/m  #Συντελεστής μεταβλητότητας CV είναι η τυπική απόκλιση προς το xbar επι τις εκατό
N <- 12 #Θέτω τις τιμές μου για χρήση τους παρακάτω
conf.interval <- qnorm(0.95)*s/sqrt(N) # Διάστημα εμπιστοσύνης
low_lim = m - conf.interval # lower limit του Δ.Ε 
high_lim = m + conf.interval # upper limit του Δ.Ε
#Ασκηση2 α)
df<-12 #βαθμόι ελευθερίας
qt(0.01,df,lower.tail=TRUE) #πιθανότητα,β.ε

#Άσκηση 3
pnorm(25, 30, 15/sqrt(25), lower.tail = T) 

